[
  {
    "id": "film1",
    "title": "One Piece Live Action",
    "description": "One Piece Live Action atau dikenal One Piece LA One Piece Live Action adalah serial televisi streaming petualangan fantasi yang dikembangkan oleh Matt Owens dan Steven Maeda untuk Netflix. Serial ini merupakan adaptasi aksi langsung dari serial manga Jepang tahun 1997 dengan nama yang sama oleh Eiichiro Oda. Manga ini diproduksi oleh Kaji Productions, Tomorrow Studios dan Shueisha (yang juga menerbitkan manganya). Serial ini menampilkan pemeran ansambel termasuk Iñaki Godoy, Mackenyu, Emily Rudd, Jacob Romero Gibson, dan Taz Skylar. Serial ini ditayangkan perdana pada tanggal 31 Agustus 2023, dan mendapat ulasan positif dari kritikus dan penggemar, yang memuji penampilan, cerita, efek visual, dan kesetiaan umum terhadap peristiwa cerita dari materi sumbernya. Serial ini Meceritakan petualangan Bajak Laut Topi Jerami, saat mereka menjelajahi lautan berbahaya, daratan, dan sekitarnya untuk mencari “One Piece”, harta karun dongeng yang akan menjadikan kapten mereka, Monkey D. Luffy, “Raja Bajak Laut” . pada serial Live Action ini akan menceritakan One Piece sampai Arc Arlong Park.",
    "image": "https://i2.wp.com/v9.animasu.cc/wp-content/uploads/2023/08/MV5-BYzcz-Mzll-N2-Ut-NDJm-OS00-Mm-E5-LWE2-MWYt-NGEw-ODcw-MDc2-M2-Yy-Xk-Ey-Xk-Fqc-Gde-QXVy-MDM2-NDM2.webp",
    "date": "2023",
    "type": "film",
    "season": ["Season 1"],
    "episodes": {
      "Season 1": [
        {
          "title": "Episode 1",
          "url": "https://filedon.co/embed/ZJdcRQr1hI"
        },
        {
          "title": "Episode 2",
          "url": "https://acefile.co/player/100450854"
        },
        {
          "title": "Episode 3",
          "url": "https://acefile.co/player/100451679"
        },
        {
          "title": "Episode 4",
          "url": "https://acefile.co/player/100454594"
        },
        {
          "title": "Episode 5",
          "url": "https://acefile.co/player/100454765"
        },
        {
          "title": "Episode 6",
          "url": "https://acefile.co/player/100454890"
        },
        {
          "title": "Episode 7",
          "url": "https://acefile.co/player/100455133"
        },
        {
          "title": "Episode 8",
          "url": "https://acefile.co/player/100455933"
        }
      ]
    }
  },
  {
    "id": "film2",
    "title": "Kimi no Na Wa (Your Name)",
    "description": "Kimi no Nawa (君の名は) atau Your Name adalah film anime yang bercerita tentang pertukaran tubuh antara dua remaja, Mitsuha Miyamizu dan Taki Tachibana. Pertukaran tubuh ini terjadi secara misterius karena pengaruh komet. ",
    "image": "https://upload.wikimedia.org/wikipedia/id/0/0b/Your_Name_poster.png",
    "date": "2016",
    "type": "film",
    "season": ["Season 1"],
    "episodes": {
      "Season 1": [
        {
          "title": "Kimi No Na Wa",
          "url": "https://filedon.co/embed/KBLfuweZjS"
        }
      ]
    }
  },
  {
    "id": "film3",
    "title": "Black Clover Movie: Sword of the Wizard King",
    "description": "Black Clover Movie: Sword of the Wizard King Saat seorang bocah pemberani yang tak bisa memakai sihir berjuang meraih gelar Kaisar Sihir, 4 Kaisar Sihir yang diasingkan kembali untuk menghancurkan Kerajaan Semanggi.",
    "image": "https://i3.wp.com/anime.oploverz.ac/wp-content/uploads/2023/06/Black-Clover-Movie-Sword-of-the-Wizard-King.jpg?resize=247,350",
    "date": "2016",
    "type": "film",
    "season": ["Season 1"],
    "episodes": {
      "Season 1": [
        {
          "title": "Black Clover",
          "url": "https://acefile.co/player/99173652"
        }
      ]
    }
  },
  {
    "id": "film4",
    "title": "Overlord Movie: The Sacred Kingdom",
    "description": "Movie kali ini akan mengambil latar cerita setelah musim ketiga dan sebelum musim keempat dari Anime musimannya.Momonga yang sekarang dikenal sebagai Raja Penyihir Ains Ooal Gown pergi ke Kerajaan Suci Roble yang diserang oleh Jaldabaoth.",
    "image": "https://i2.wp.com/anime.oploverz.ac/wp-content/uploads/2025/03/Overlord-Movie-The-Sacred-Kingdom.jpg?resize=247,350",
    "date": "2016",
    "type": "film",
    "season": ["Season 1"],
    "episodes": {
      "Season 1": [
        {
          "title": "Film OverLord",
          "url": "https://filedon.co/embed/U9pQSO5ewx"
        }
      ]
    }
  },
  {
    "id": "film5",
    "title": "Sword Art Online the Movie 1: Progressive – Aria of a Starless Night",
    "description": "Menceritakan kembali Arc Aincrad yang diambil dari sudut pandang Asuna. Yuuki  Asuna sedang dalam tahap untuk lulus ujian masuk SMA-nya. Teman sekelasnya, Misumi “Mito” Tozawa, menyarankannya untuk beristirahat sejenak dari belajar dan ikut bermain dengannya pada hari peluncuran Sword Art Online (SAO)—game realitas virtual online yang sangat dinanti. Asuna menerima tawarannya dan segera menemuinya di dalam game. Namun tak disangka, Asuna, Mito, dan setiap pemain lain bermain SAO harus terjebak dalam permainan itu secara permanen. Satu-satunya jalan keluar adalah dengan menyelesaikan seluruh seratus lantai permainan, dan yang lebih buruk lagi, mati di dalam permainan akan membunuh pemain di kehidupan nyata. Sword Art Online the Movie 1: Progressive – Aria of a Starless Night",
    "image": "https://i1.wp.com/anime.oploverz.ac/wp-content/uploads/2022/07/Sword-Art-Online-the-Movie-1-Progressive-Aria-of-a-Starless-Night.jpg?resize=247,350",
    "date": "2022",
    "type": "film",
    "season": ["Season 1"],
    "episodes": {
      "Season 1": [
        {
          "title": "Film Sword Art Online",
          "url": "https://acefile.co/player/78895159"
        }
      ]
    }
  },
  {
    "id": "film6",
    "title": "Sword Art Online the Movie 2: Progressive – Scherzo of Deep Night",
    "description": "Sword Art Online the Movie 2: Progressive – Scherzo of Deep Night Setelah mengalahkan bos lantai lagi dan melangkah melewati gerbang lantai lima, Kirigaya “Kirito” Kazuto dan Yuuki Asuna disambut dengan pemandangan indah reruntuhan yang runtuh dan bangunan bawah tanah yang penuh misteri. Namun, petualangan indah ini hanya berjalan singkat. Ketegangan antara Pasukan Ksatria Naga dan Pasukan Pembebasan Aincrad—dua guild terkemuka yang berfokus untuk menyelesaikan Sword Art Online—terus meningkat dan mengancam stabilitas yang rapuh dari kelompok penyerang garis depan. Kirito dan Asuna terpaksa bertindak cepat, membuat pertaruhan putus asa dan mengumpulkan sejumlah kecil sekutu untuk misi berbahaya. Akibatnya, Asuna dan Tozawa “Mito” Misumi harus berdamai dengan hubungan mereka setelah hampir terjadi tragedi yang memaksa mereka berpisah di lantai pertama.",
    "image": "https://i2.wp.com/anime.oploverz.ac/wp-content/uploads/2023/06/Sword-Art-Online-the-Movie-2-Progressive-Scherzo-of-Deep-Night.jpg?resize=247,350",
    "date": "2023",
    "type": "film",
    "season": ["Season 1"],
    "episodes": {
      "Season 1": [
        {
          "title": "Film Sword Art Online",
          "url": "https://filedon.co/embed/4R64DwP8EB"
        }
      ]
    }
  },
  {
    "id": "film7",
    "title": "The Last: Naruto the Movie",
    "description": "Naruto the Movie: The Last atau Naruto: Shippuuden Movie 7 – The Last Bercerita Dua tahun telah berlalu sejak berakhirnya Perang Ninja Besar Keempat. Konohagakure tetap dalam keadaan damai dan harmonis—sampai Hokage Keenam Kakashi Hatake menyadari bahwa bulan sedang mendekati Bumi, menimbulkan ancaman kehancuran planet. Di tengah cobaan berat, Konoha diserang oleh kejahatan baru, Toneri Oosutuski, yang tiba-tiba menculik adik perempuan Hinata Hyuuga, Hanabi. Kakashi mengirimkan tim ninja terampil yang terdiri dari Naruto Uzumaki, Sakura Haruno, Shikamaru Nara, Sai, dan Hinata dalam upaya untuk menyelamatkan Hanabi dari cengkeraman jahat Toneri. Namun, selama misi mereka, tim menghadapi beberapa kendala yang menantang mereka, menggagalkan upaya mereka. Dengan penculikannya, hubungan yang dibagikan tim satu sama lain diuji, dan dengan dunia mencapai ambang kehancuran, mereka harus berpacu dengan waktu untuk memastikan keselamatan planet mereka. Sementara itu, saat pertempuran terjadi, Naruto terdorong untuk memperjuangkan sesuatu yang lebih besar dari yang pernah ia bayangkan—cinta.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT_cui3mmhqEJw6PTr-tiJ7XeIcu6i2vw4EU84rq29oCw&s",
    "date": "2016",
    "type": "film",
    "season": ["Season 1"],
    "episodes": {
      "Season 1": [
        {
          "title": "Film The Last Naruto",
          "url": "https://ww1.anoboy.app/uploads/stream/embed.php?data=q96F7jdq2QFdRiT+YaaFCmyZHvGWGPZsuDHsr//NMzo48oQzp1k342UuavNQKUUkpUbTxdM6FbS9+EF7jNxY1L9IdfXNC2DbGeHptRdeXJOim4gKa/Bar0hv"
        }
      ]
    }
  },
  {
    "id": "film8",
    "title": "One Piece Red",
    "description": "Menceritakan Uta, mantan musisi Bajak Laut Rambut Merah dan teman masa kecil Monkey D. Luffy—berjanji bahwa dia akan membangun era kebebasan baru dengan menampilkan musik yang menyenangkan bagi dunia., konser live akan diadakan di mana ia akan muncul di hadapan dunia untuk pertama kali. Acaranya menjadi topik hangat yang diperbincangkan oleh bajak laut, maupun angkatan laut, dan tentu saja Luffy bersama teman-temannya. Hari pertunjukan live tiba, suara Uta menggema di seluruh penjuru dunia",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTk6FWKhbX1HGsDt7s7f-1XmztDL3NZsinaRscHJYqzX4u8Shb-zhCQF6Kt&s=10",
    "date": "2022",
    "type": "film",
    "season": ["One Piece Red"],
    "episodes": {
      "One Piece Red": [
        {
          "title": "Full Movie",
          "url": "https://mega.nz/embed/zXJWjLCY#tk-NY3Ix-mMo0WjjvwZ9Qscaa-JVL39rGCrWYONaarI"
        }
      ]
    }
  }
]
